RIET/src/InformationRegisters/НаличиеПрисоединенныхФайлов/НаличиеПрисоединенныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаличиеПрисоединенныхФайлов</name>
  <resources>
    <name>ЕстьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектСФайлами</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/СчетКнигиПокупок/СчетКнигиПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетКнигиПокупок</name>
  <registerRecords>AccumulationRegister.НеоплаченныеОстаткиПоВаучерам</registerRecords>
  <registerRecords>AccumulationRegister.ПроводкиDSSОбщие</registerRecords>
  <registerRecords>AccumulationRegister.НДСНачисленный</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеОтчетаПоКнигеПокупок</registerRecords>
  <registerRecords>InformationRegister.ЖурналУчетаСчетовФактур</registerRecords>
  <registerRecords>AccumulationRegister.МатериальныеАктивы</registerRecords>
  <attributes>
    <name>ЭтоДокументИнтеркомпани</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>CashCode</name>
    <type>
      <types>CatalogRef.CashCode</types>
    </type>
  </attributes>
  <attributes>
    <name>Ваучер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗатрат</name>
    <type>
      <types>CatalogRef.ОписаниеЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаСНДСРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаБезНДСРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСДокументаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВКнигуПокупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WHT</name>
    <comment>With holded tax</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасхождениеСуммыСНДСИAC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректировкаРасхожденияСуммыСНДСИAC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможеннаяДекларация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРубСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроводкаDSS</name>
    <type>
      <types>DocumentRef.ПроводкаDSS</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоступлениеТоваровУслугЭД</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Deferred</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Суммы</name>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДСРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоступлениеТоваровИУслуг</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/CommonModules/ПрисоединенныеФайлыСКП/Module.bsl
Функция ПрочитатьКаталог(Путь) Экспорт 
	
	СписокФайлов = Новый ТаблицаЗначений;
	СписокФайлов.Колонки.Добавить("ИмяФайла",Новый ОписаниеТипов("Строка",,новый КвалификаторыСтроки(250)));
	СписокФайлов.Колонки.Добавить("ИмяБезРасширения",Новый ОписаниеТипов("Строка",,новый КвалификаторыСтроки(100)));
	
	ДатаКонец = КонецМесяца(ТекущаяДата());
	ДатаНачало = НачалоМесяца(ДобавитьМесяц(ДатаКонец,-6));
	ТекМесяц = ДатаНачало;   
	Было = 0;
	Для Месяц = 1 по 6 цикл
		ТМ = Формат(ТекМесяц,"ДФ=yyyy\");                      
		ТекКаталог = Путь+ТМ;
		ПолучитьСписокФайлов(ТекКаталог,Формат(ТекМесяц,"ДФ=MM"),СписокФайлов);
		ЗаписьЖурналаРегистрации("Отладка",,,,"За " + ТекМесяц + " считано " + (СписокФайлов.Количество() - Было) + " из каталога " + ТекКаталог,);
		Было = СписокФайлов.Количество();
		ТекМесяц = ДобавитьМесяц(ТекМесяц,1);
	КонецЦикла;
	СписокФайлов.Свернуть("ИмяФайла,ИмяБезРасширения");
	СписокФайловДокументов = УстановитьСоответсвие(СписокФайлов,ДатаНачало,ДатаКонец);
	Возврат СписокФайловДокументов;
	
КонецФункции

Функция УстановитьСоответсвие(СписокФайлов,ДатаНачало,ДатаКонец)
	
	Запрос = новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокФайлов",СписокФайлов);
	Запрос.УстановитьПараметр("ДатаНачало",ДатаНачало);
	Запрос.УстановитьПараметр("ДатаКонец",ДатаКонец);
	СписокКодов = новый СписокЗначений;
	СписокКодов.Добавить("OP0399"); //PES FZE
	СписокКодов.Добавить("OP0311"); //SRP FZE
	СписокКодов.Добавить("OC0114P1"); //OIES
	Запрос.УстановитьПараметр("Gold", СписокКодов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокФайлов.ИмяФайла,
	|	СписокФайлов.ИмяБезРасширения КАК ИмяБезРасширения
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	&СписокФайлов КАК СписокФайлов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяБезРасширения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Поставщики
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(НЕ Контрагенты.КонтрагентLawson.Код ПОДОБНО ""E%"")
	|	И (НЕ Контрагенты.КонтрагентLawson.Код В (&Gold))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаличиеПрисоединенныхФайлов.ОбъектСФайлами КАК ОбъектСФайлами
	|ПОМЕСТИТЬ СКПсФайлами
	|ИЗ
	|	РегистрСведений.НаличиеПрисоединенныхФайлов КАК НаличиеПрисоединенныхФайлов
	|ГДЕ
	|	НаличиеПрисоединенныхФайлов.ЕстьФайлы
	|	И НаличиеПрисоединенныхФайлов.ОбъектСФайлами ССЫЛКА Документ.СчетКнигиПокупок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектСФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетКнигиПокупок.Ссылка КАК СКП
	|ПОМЕСТИТЬ СКППоДате
	|ИЗ
	|	Документ.СчетКнигиПокупок КАК СчетКнигиПокупок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Поставщики КАК Поставщики
	|		ПО СчетКнигиПокупок.Контрагент = Поставщики.Ссылка
	|ГДЕ
	|	СчетКнигиПокупок.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СКП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 60000
	|	СКППоДате.СКП КАК Документ,
	|	СКППоДате.СКП.ПроводкаDSS.Reference КАК Reference,
	|	СКППоДате.СКП.ПроводкаDSS.TransNbr КАК TransNbr
	|ПОМЕСТИТЬ СПОПоДатеБезФайлов
	|ИЗ
	|	СКППоДате КАК СКППоДате
	|ГДЕ
	|	(НЕ СКППоДате.СКП В
	|				(ВЫБРАТЬ
	|					СКПсФайлами.ОбъектСФайлами
	|				ИЗ
	|					СКПсФайлами))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СПОПоДатеБезФайлов.Документ КАК скп,
	|	ВремТаб.ИмяБезРасширения,
	|	ВремТаб.ИмяФайла
	|ИЗ
	|	СПОПоДатеБезФайлов КАК СПОПоДатеБезФайлов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТаб КАК ВремТаб
	|		ПО (СПОПоДатеБезФайлов.Reference <> """")
	|			И (ВремТаб.ИмяБезРасширения ПОДОБНО ""%"" + СПОПоДатеБезФайлов.Reference + ""%"")";
	
	РезВрем = Запрос.Выполнить().Выгрузить();
	ЗаписьЖурналаРегистрации("Отладка",,,,"Первый запрос " + РезВрем.Количество(),);
	
	//Использую 1 и тот же запрос что бы не перекидывать МВТ и не делать 3 запроса тех же заново.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СПОПоДатеБезФайлов.Документ,
	|	ВремТаб.ИмяБезРасширения,
	|	ВремТаб.ИмяФайла
	|ИЗ
	|	СПОПоДатеБезФайлов КАК СПОПоДатеБезФайлов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТаб КАК ВремТаб
	|		ПО (СПОПоДатеБезФайлов.TransNbr <> """")
	|			И (ВремТаб.ИмяБезРасширения ПОДОБНО ""%"" + СПОПоДатеБезФайлов.TransNbr + ""%"")";
	
	попытка
	РезВрем2 = Запрос.Выполнить().Выгрузить();
	ЗаписьЖурналаРегистрации("Отладка",,,,"Второй запрос " + РезВрем2.Количество(),);
	
	для каждого стр из РезВрем2 цикл
		строка = РезВрем.Добавить();
		строка.СКП = стр.Документ;
		строка.ИмяБезРасширения = стр.ИмяБезРасширения;
		строка.ИмяФайла = стр.ИмяФайла;
	КонецЦикла;
	Исключение
	конецпопытки;
	РезВрем.Свернуть("СКП,ИмяБезРасширения,ИмяФайла");
	ЗаписьЖурналаРегистрации("Отладка",,,,"Свернули",);
	///Тут файлы могут прицепиться к нескольким документам, но этого не будет ибо 
	///файлы будут цепляться последовательно к результатам из первого запроса (без дублей) а потом уже к 
	///результатам из второго, после чего записи не будет ибо такой файл уже есть.... 
	Возврат РезВрем;
	
КонецФункции

Функция ПолучитьСписокФайлов(Путь,Месяц = "",СписокФайлов)
	Было = СписокФайлов.количество();
	НайденныеФайлы = НайтиФайлы(Путь, "*.*"); 
	Для каждого НайденныйФайл Из НайденныеФайлы Цикл 
		Если НайденныйФайл.ЭтоКаталог() Тогда
			Если СтрНайти(НайденныйФайл.Имя,Месяц) = 1 тогда 
				КаталогМесяца = НайденныйФайл.ПолноеИмя;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	НайденныеФайлы = НайтиФайлы(КаталогМесяца, "*.pdf", истина); 
	Для каждого НайденныйФайл Из НайденныеФайлы Цикл 
		Строка = СписокФайлов.Добавить();
		Строка.ИмяФайла = НайденныйФайл.ПолноеИмя;
		Строка.ИмяБезРасширения = НайденныйФайл.ИмяБезРасширения;
	КонецЦикла;
	ЗаписьЖурналаРегистрации("Отладка",,,,"Считано " + (СписокФайлов.Количество() - Было) + " из каталога " + КаталогМесяца,);
	Возврат СписокФайлов;
КонецФункции
